In [1]:
# Dependencies and Setup
import pandas as pd
import csv
#import os

In [2]:
# File to Load (Remember to Change These)
books_data_to_load = "Resources/book900k-1000k.csv"

# Read data file into into Pandas dataframe
books_df = pd.read_csv(books_data_to_load)
#books_df.head()

In [3]:
books_df.shape

(40890, 20)

In [4]:
books_df.describe()

,Id,Rating,PublishYear,PublishMonth,PublishDay,CountsOfReview,pagesNumber,Count of text reviews
count,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000,40890.000000
mean,949177.751431,3.469541,1998.890584,9.709636,6.346075,8.834238,276.196747,8.834238
std,29062.356909,1.242119,8.462135,10.235637,3.565110,71.253610,505.166816,71.253610
min,900000.000000,0.000000,1899.000000,1.000000,1.000000,0.000000,0.000000,0.000000
25%,923881.250000,3.470000,1995.000000,1.000000,3.000000,0.000000,153.000000,0.000000
50%,948838.500000,3.840000,2001.000000,4.000000,6.000000,1.000000,241.000000,1.000000
75%,974600.250000,4.090000,2005.000000,17.000000,9.000000,4.000000,340.000000,4.000000
max,999998.000000,5.000000,2020.000000,31.000000,12.000000,6495.000000,80500.000000,6495.000000

In [5]:
columns = books_df.columns
columns

Index(['Id', 'Name', 'Authors', 'ISBN', 'Rating', 'PublishYear',
       'PublishMonth', 'PublishDay', 'Publisher', 'RatingDist5', 'RatingDist4',
       'RatingDist3', 'RatingDist2', 'RatingDist1', 'RatingDistTotal',
       'CountsOfReview', 'Language', 'pagesNumber', 'Description',
       'Count of text reviews'],
      dtype='object')

In [6]:
removed_columns = ['RatingDist5', 'RatingDist4',
               'RatingDist3', 'RatingDist2', 'RatingDist1', 'pagesNumber',
                'RatingDistTotal', 'Count of text reviews', 'CountsOfReview','Description']

In [7]:
# drop unused columns
books_df.drop(columns = removed_columns, inplace=True)

In [8]:
# rename columns
books_df = books_df.rename(columns={'Id':'BookId', 'Name':'Title', 'PublishYear':'PublishY', 
                                    'PublishMonth':'PublishD', 'PublishDay':'PublishM'})

books_df.head()

,BookId,Title,Authors,ISBN,Rating,PublishY,PublishD,PublishM,Publisher,Language
0,900000,Cabinet 03: Weather,Jeffrey Kastner,1932698019,4.00,2004,2,1,Cabinet,NaN
1,900001,"Workouts in a Binder for Swimmers, Triathletes...",Nick Hansen,1931382743,4.48,2005,18,11,Velo Press,NaN
2,900002,Las 120 jornadas de Sodoma,Marquis de Sade,8472233847,3.12,1992,1,3,TusQuets,NaN
3,900004,The Traveler: An American Odyssey in the Himal...,Eric Hansen,0871563509,4.18,1995,6,6,"Random House, Inc.",NaN
4,900006,Vertical Smile,Richard Condon,0297994026,3.74,1972,20,4,Littlehampton Book Services Ltd,NaN

In [9]:
# books_df.columns

In [10]:

# by_lang_df = books_df.sort_values(['Language'], ascending=True) #.sum()['Language']
# nan_lang_counts = books_df.loc[by_lang_df.Language == NaN]
# by_lang_df.head()

In [11]:
# # replace all NaN value in Language column by eng

values ={'Language':'eng'}
books_df.fillna(value = values, inplace=True)

In [12]:
# save to csv file
books_df.to_csv("Resources/cleaned_books.csv", index=False)

In [13]:
# filter data to keep Language with 'en-GB' & 'en-US' value
# en_books_df = books_df.loc[(books_df.Language == 'en-GB') | (books_df.Language == 'en-US')]
# en_books_df.tail()

In [14]:
# en_books_df.shape

In [15]:
# save to csv file
# en_books_df.to_csv("Resources/en_cleaned_books.csv", index=False)

In [16]:
rating_counts = books_df.groupby("Rating").count()
rating_counts.head()
#rating_counts.shape

,BookId,Title,Authors,ISBN,PublishY,PublishD,PublishM,Publisher,Language
Rating,,,,,,,,,
0.00,4013,4013,4013,4008,4013,4013,4013,3961,4013
1.00,93,93,93,92,93,93,93,93,93
1.33,1,1,1,1,1,1,1,1,1
1.50,11,11,11,11,11,11,11,9,11
1.55,1,1,1,1,1,1,1,1,1

In [17]:
author_counts = author_list = books_df.Authors.nunique()
author_counts

28666

In [18]:
author_list = books_df.groupby("Authors").nunique()['Authors']

In [19]:
author_list_df = pd.DataFrame(author_list)

In [20]:
# rename column and reset index
author_list_df = author_list_df.rename(columns={'Authors':'Count'})
author_list_df.reset_index(inplace=True)
author_list_df

                        Authors  Count
0      'Izz al-Din Ibn al-Athir      1
1                       50 Cent      1
2      6' Ferret Writers' Group      1
3           A H Keesman-Marwitz      1
4                     A. Ashley      1
...                         ...    ...
28661       Øivind Storm Bjerke      1
28662               Ānandamūrti      1
28663             Дарья Донцова      1
28664         جبرا إبراهيم جبرا      1
28665            مسلم بن الحجاج      1

[28666 rows x 2 columns]

In [21]:
# sort authors list  by name

author_list_df = author_list_df.sort_values(["Authors"], ascending = True)
#author_list_df.tail()

In [22]:
# save to csv file

# author_list_df.to_csv("Resources/authors_list.csv", index=False)

### cleaned books

In [23]:
# before: there was 40,890 records and 20 columns with NaN value in Language

# after: removed ten columns ('RatingDist5', 'RatingDist4',
#     'RatingDist3', 'RatingDist2', 'RatingDist1', 'RatingDistTotal',
#     'pagesNumber','Count of text reviews', 'CountsOfReview', 'Description') from the dataset
# rename 'Id' to 'Book_id' and 'Name' to 'Title'
# replace all NaN value in Language by 'eng'

# observastion: in the cleaned_books dataset there is "blank" and date ("10/18/2020") 
# value in publisher column. please take this into consideration when using the cleaned_books dataset.

### cleaned authors

In [55]:
# File to Load 
data_to_load = "Resources/authors_list.csv"

# Read data file into into Pandas dataframe
authors_df = pd.read_csv(data_to_load)
authors_df.head()

                    Authors  Count
0  'Izz al-Din Ibn al-Athir      1
1                   50 Cent      1
2  6' Ferret Writers' Group      1
3       A H Keesman-Marwitz      1
4                 A. Ashley      1

In [56]:
authors_df.drop(columns=['Count'], inplace=True)

In [57]:
authors_df = authors_df.rename(columns={'Authors':'AuthorName'})

authors_df.head()

                 AuthorName
0  'Izz al-Din Ibn al-Athir
1                   50 Cent
2  6' Ferret Writers' Group
3       A H Keesman-Marwitz
4                 A. Ashley

In [65]:
# loading author_id file
data_to_load = "Resources/author_id.csv"

# Read data file into into Pandas dataframe
author_id_df = pd.read_csv(data_to_load)
author_id_df.head()

,Unnamed: 0,author_id,author_name,author_link
0,0,14980615,Chip Gaines,https://www.goodreads.com/author/show/14980615...
1,1,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...
2,2,61105,Dr. Seuss,https://www.goodreads.com/author/show/61105.Dr...
3,3,3362,Eric Carle,https://www.goodreads.com/author/show/3362.Eri...
4,4,4880403,Emily Winfield Martin,https://www.goodreads.com/author/show/4880403....

In [87]:
author_id_df.shape

(247, 3)

In [66]:
# rename columns AuthorId
author_id_df = author_id_df.rename(columns={'author_id':'AuthorId', 'author_name':'AuthorName','author_link':'AuthorLink'})

In [67]:
# drop unused column
author_id_df.drop(columns=['Unnamed: 0'], inplace=True)

In [68]:
author_id_df.head()

,AuthorId,AuthorName,AuthorLink
0,14980615,Chip Gaines,https://www.goodreads.com/author/show/14980615...
1,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...
2,61105,Dr. Seuss,https://www.goodreads.com/author/show/61105.Dr...
3,3362,Eric Carle,https://www.goodreads.com/author/show/3362.Eri...
4,4880403,Emily Winfield Martin,https://www.goodreads.com/author/show/4880403....

In [69]:
# merge authors_df with author_id_df

merged_authors_df = authors_df.merge(author_id_df, how='inner', on = 'AuthorName')

In [70]:
merged_authors_df.head()

,AuthorName,AuthorId,AuthorLink
0,Abraham Verghese,93353,https://www.goodreads.com/author/show/93353.Ab...
1,Alan Moore,3961,https://www.goodreads.com/author/show/3961.Ala...
2,Audrey Niffenegger,498072,https://www.goodreads.com/author/show/498072.A...
3,Bill Martin Jr.,5086768,https://www.goodreads.com/author/show/5086768....
4,Bob Woodward,15441,https://www.goodreads.com/author/show/15441.Bo...

In [74]:
merged_authors_df.shape

(62, 3)

In [73]:
# save data to file
merged_authors_df.to_csv('Resources/merged_authors.csv', index=False)

### cleaned bestsellers

In [104]:
# File to Load 
data_to_load = "Resources/bestsellers with categories.csv"

# Read data file into into Pandas dataframe
bestsellers_df = pd.read_csv(data_to_load)
bestsellers_df.head()

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

In [105]:
# rename columns

bestsellers_df = bestsellers_df.rename(columns = {'Name': 'Title', 'Author':'AuthorName',
                                                    'User Rating': 'Rating', 'Year':'PublishY'})

In [106]:
# drop unused column
bestsellers_df.drop(columns = 'Reviews', inplace=True)

bestsellers_df.head()

,Title,AuthorName,Rating,Price,PublishY,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,12,2019,Non Fiction

In [107]:
bestsellers_df.shape

(550, 6)

In [108]:
# save to file
#bestsellers_df.to_csv('Resources/bestsellers.csv')

### create author_book data

In [83]:
books_df.head()

,BookId,Title,Authors,ISBN,Rating,PublishY,PublishD,PublishM,Publisher,Language
0,900000,Cabinet 03: Weather,Jeffrey Kastner,1932698019,4.00,2004,2,1,Cabinet,eng
1,900001,"Workouts in a Binder for Swimmers, Triathletes...",Nick Hansen,1931382743,4.48,2005,18,11,Velo Press,eng
2,900002,Las 120 jornadas de Sodoma,Marquis de Sade,8472233847,3.12,1992,1,3,TusQuets,eng
3,900004,The Traveler: An American Odyssey in the Himal...,Eric Hansen,0871563509,4.18,1995,6,6,"Random House, Inc.",eng
4,900006,Vertical Smile,Richard Condon,0297994026,3.74,1972,20,4,Littlehampton Book Services Ltd,eng

In [88]:
books_df = books_df.rename(columns={'Authors':'AuthorName'})

In [84]:
author_id_df.head()

,AuthorId,AuthorName,AuthorLink
0,14980615,Chip Gaines,https://www.goodreads.com/author/show/14980615...
1,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...
2,61105,Dr. Seuss,https://www.goodreads.com/author/show/61105.Dr...
3,3362,Eric Carle,https://www.goodreads.com/author/show/3362.Eri...
4,4880403,Emily Winfield Martin,https://www.goodreads.com/author/show/4880403....

In [86]:
author_id_df.shape

(247, 3)

In [89]:
# merge to create dataframe with AuthorId & AuthorName
author_id_name_df = author_id_df.merge(books_df, on = 'AuthorName')

In [91]:
author_id_name_df.columns

Index(['AuthorId', 'AuthorName', 'AuthorLink', 'BookId', 'Title', 'ISBN',
       'Rating', 'PublishY', 'PublishD', 'PublishM', 'Publisher', 'Language'],
      dtype='object')

In [94]:
# drop unused columns
author_id_name_df.drop(columns = ['Title', 'ISBN', 'Rating', 'PublishY', 
                                'PublishD', 'PublishM', 'Publisher', 'Language'], inplace=True)

In [95]:
author_id_name_df.head()

,AuthorId,AuthorName,AuthorLink,BookId
0,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...,904935
1,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...,904936
2,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...,904937
3,33280,Dav Pilkey,https://www.goodreads.com/author/show/33280.Da...,948272
4,61105,Dr. Seuss,https://www.goodreads.com/author/show/61105.Dr...,900821

### check and mark if the book title is in bestsellers

In [100]:
# merge to get BookId for bestsellers dataframe
books_df = books_df.rename(columns={'Authors':'AuthorName'})

In [109]:
books_df.columns

Index(['BookId', 'Title', 'AuthorName', 'ISBN', 'Rating', 'PublishY',
       'PublishD', 'PublishM', 'Publisher', 'Language'],
      dtype='object')

In [110]:
#bestsellers_df = bestsellers_df.merge(books_df, on='AuthorName')
bestsellers_df.columns

Index(['Title', 'AuthorName', 'Rating', 'Price', 'PublishY', 'Genre'], dtype='object')

In [111]:
bestsellers_df = bestsellers_df.merge(books_df, on='AuthorName')

In [112]:
bestsellers_df.shape

(621, 15)

In [113]:
bestsellers_df.to_csv('Resources/bestsellers_author.csv')